<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"384b73caebca3c29854c868f84b7e35578dc8bccd30ec294d8910431a0236c5a","plan_job_ref":"Job Create terraform plan #19 at https://github.com/leonitousconforti/infra/actions/runs/15421002307","plan_out_hash":"3f006e7fe6b8b1c59955cfc18b78739dc0cdc3d2501cd9ba493991579060d5c4","plan_hash":"41b08e4905b2d6b48e0cd0504cba2600700975b34c2fb1dad5192aacf8464d2b","plan_text_format":"diff","version":"2.0.0"} -->
Terraform plan in __ltgk.net__<details open><summary>With variables</summary>

```hcl
do_token           = (sensitive value)
porkbun_api_key    = (sensitive value)
porkbun_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # digitalocean_droplet.gateway_ams3[0] will be created
+   resource "digitalocean_droplet" "gateway_ams3" {
+       backups              = false
+       created_at           = (known after apply)
+       disk                 = (known after apply)
+       droplet_agent        = true
+       graceful_shutdown    = false
+       id                   = (known after apply)
+       image                = "ubuntu-24-04-x64"
+       ipv4_address         = (known after apply)
+       ipv4_address_private = (known after apply)
+       ipv6                 = true
+       ipv6_address         = (known after apply)
+       locked               = (known after apply)
+       memory               = (known after apply)
+       monitoring           = true
+       name                 = "gateway.ams3.ltgk.net"
+       price_hourly         = (known after apply)
+       price_monthly        = (known after apply)
+       private_networking   = (known after apply)
+       region               = "ams3"
+       resize_disk          = true
+       size                 = "s-1vcpu-512mb-10gb"
+       ssh_keys             = [
+           "47660013",
        ]
+       status               = (known after apply)
+       tags                 = [
+           "gateway",
        ]
+       urn                  = (known after apply)
+       vcpus                = (known after apply)
+       volume_ids           = (known after apply)
+       vpc_uuid             = "8118626f-7bc0-432e-9efb-5b97d1c3501f"
    }

  # digitalocean_record.gateway_ams3_AAAA_record will be created
+   resource "digitalocean_record" "gateway_ams3_AAAA_record" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "gateway.ams3"
+       ttl    = 3600
+       type   = "AAAA"
+       value  = (known after apply)
    }

  # digitalocean_record.gateway_ams3_A_record will be created
+   resource "digitalocean_record" "gateway_ams3_A_record" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "gateway.ams3"
+       ttl    = 3600
+       type   = "A"
+       value  = (known after apply)
    }

  # digitalocean_reserved_ip.gateway_ams3_reserved_ip will be created
+   resource "digitalocean_reserved_ip" "gateway_ams3_reserved_ip" {
+       droplet_id = (known after apply)
+       id         = (known after apply)
+       ip_address = (known after apply)
+       region     = "ams3"
+       urn        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #19](https://github.com/leonitousconforti/infra/actions/runs/15421002307)